package lxkj.train.com.overall;

/**
 * Created by dell on 2018/6/25.
 */

public class TextUtil {
    public static String[] textTitle = {"出勤准备","指纹测酒","通报传达","领取资料","核对揭示","核对IC卡",
            "安全预想","施工行车","学习指导"};
    public static String[] textContent = {"按规定着装；携带证件和相关行车资料，开启录音笔",
            "接受机调员证件检查和指纹影像识别，酒精含量测试。",
            "机车调度员传达安全通报，上级要求","递交IC卡，领取司机报单，车机联控信息单，司机手册，添乘指导簿，列出时刻表，交付揭示，电务车载设备检查合格证。",
            "核对公布运行揭示及有关安全注意事项，勾划交付揭示；摘抄临时限速，站名处标记“△”",
            "领取IC卡，在模拟设备上查验，与交付揭示逐条核对，确认数据完整性正确后登记签字；",
            "开展安全预想，指定安全措施，记录交路号，车站号，车速等级和支线号。",
            "阅读并正确理解<施工行车安全明示图>，熟练掌握行车办法，LKJ操作方法和安全注意事项。","学习一条(非正常行车)规章，汇报预想预防内容，听取出乘指导，司机手册，交付揭示交机车调度员审核和盖章，相互确认后领回。"};
    public static String[] kTextTitle = {"上车准备","静态检查","甩车升弓","机能实验","撤除防溜","走车实验",
            "要道还道","注意事项","换室操作","挂车注意","机车供电","状态确认","连接检查",
            "交接设定","列尾设置","试风试验","查验证件","发车准备","开车确认"};
    public static String[] kTextContent = {"机班同到地(外)勤，领取机车钥匙，“机车运行日志”，无线对讲设备，GSM-R手持终端(需要时)，工具，备品，棉丝等物品，办理燃料，耗电交接手续。查阅“机车运行日志”交接内容，了解机车技术状态。",
            "机班按分工范围和规定顺序进行机车检查，试验，重点复查修理项目。\n" +
                    "1. 确认LKJ时钟正确，年月日时分记录于司机手册。核对粘贴在显示器上的数据“版本标签”，LKJ显示的数据版本号，电务车载设备检测合格证记载的数据版本号一致。\n" +
                    "2. 导入LKJ临时数据文件，拔卡查询。逐项输入数据参数，记录LKJ数据版本号。\n" +
                    "3. CIR通话录音和回访实验；开启列尾装置控制设备；6A系统自检正常。",
            "内燃机车按规定甩车；电力机车按规定升弓(需确认全员到岗，到位，车顶，高压室，车底无人，车顶绝缘状态良好，受电弓工作风压不低于600kPa)",
            "动态检查，制动机，电器试验(注意防溜)，记录机能实验情况。",
            "司机松开人力制动机(缓解停放制动装置)，确认完全缓解；单阀全制位，撤除铁鞋(止齿轮)，记录时间。",
            "确认线路和人身安全，方可进行走车和单机制动力实验。速度低于5km/h，单阀制动停车。",
            "按<段细>的规定要道还道(联系进路)，准备出段。与雾霾等恶劣天气时，出段前确认车顶高压隔离开关打开，非运用受电弓隔离。",
            "1. 打开侧窗，学习司机(非操纵司机)立岗，确认信号，鸣笛动车。\n" +
                    "2. 首架信号机(非集中区为股道号，道岔表示器)，探头手比，严守速度。\n" +
                    "3. 站，段分界点一度停车，保持制动，签认时分；了解挂车股道，走形经路等事项。\n" +
                    "4. 执行车机联控，记录出段时分。\n" +
                    "5. 穿正须问路，记录时间和股道，信号开放，定标打点后方可动车；穿正前的最后一架调车信号机前再次“手比呼唤”，定标打点。\n" +
                    "6. 正线返岔严格控速，确认站界标(反向进站信号机)位置，最外方道岔处起不超过5km/h，严禁越出站界。\n" +
                    "7. 尽头线调车前定标打点，进入股道起15km/h以下。距车档30m时，不超5km/h。机车与线路终端(车档)应有10m的安全距离，特殊情况必须近于10m时，一度停车，不超过5km/h前移。电力机车运行前端距接触网终点标不得近于10m。\n" +
                    "8. 单机返岔，停车位置距返岔信号机不少于10m。特殊情况不足10m，下车确认信号。",
            "机车处于制动状态。内燃机车须将自阀手柄置制动区，制动主管减压不少于100kPa，机车制动缸压力不少于100kPa后自阀取把位；电力机车须断电升弓，自阀重联位；插上锁闭销，断开电钥匙。",
            "1. 进入挂车线后，严格按十，五，三车距离控制机车速度(十车15km/h,五车10km/h,三车及以内5km/h)，执行一度停车和确认呼唤。警冲标外方确认脱轨表示器显示状态，防护信号机设置以及车列停留位置，在距显示遮断状态的脱轨表示器，防护信号或车列10m前停车。\n" +
                    "2. 确认脱轨器，防护信号撤除，具备连挂条件后，定标打点，根据连结信号以不超5km/h的速度平稳连挂。\n" +
                    "3. 根据需要适量撒砂，连挂后试拉。",
            "确认供电系统在断开位(电力机车应降下受电弓)后，降供电钥匙交给(在机车与客车连接处或机车上)客列作业人员(车辆乘务员)，并在<机车供电旅客列车供电作业签认薄(机车)>上签字。",
            "换端后，机车保持全制动。自阀置运转位，确认总风缸，受电弓工作风压达到定压，提手柄确认牵引电流；确认机车信号上下行开关，退出调车。",
            "检查确认机车与第一位车辆的车钩，车钩防跳装置，软管连接(制动主管，总风管)，折角塞门和机车走形部状态。",
            "办理货票或旅客列车编组顺序表的交接，正确输入LKJ有关数据；选定CIR通信模式和运行线路。在GSM-R区段运行时，CIR，GSM-R手持终端按规定注册列车车次；微机控制制动系统时核对列车种类。",
            "旅客列车进行ID号输号操作并记录，确认连接正常；货物列车根据要求，按压功能键，确认“一对一”。",
            "1. 全部实验：自阀减压50kPa(编组60辆及以上时位70kPa)并保压1min，泄露量不超20kPa；自阀最大有效减压(定压500kPa为140kPa；600kPa为170kPa)\n" +
                    "2. 简略试验：自阀减压100kPa并保持1min，漏泄量不超过20kPa。\n" +
                    "3. 记录排风起，止时间及减压量，排风结束，充风缓解定标打点\n" +
                    "4. 试验完毕，确认防护撤除。自阀减压不少于100kPa。\n" +
                    "5. 遇关门车辆数超规定，发车前校核制动效能证明书，做好安全预想。",
            "检查添乘(登乘)机车人员证件或调度命令并做好记录。",
            "车机联控，全员确认行车凭证，机车信号，发车信号，例行呼唤(应答)，查询列尾风压，确认制动机手柄和各开关位置，各仪表，显示屏显示，鸣笛动车。",
            "起动报点，后部瞭望(单司机除外)，准确按压[开车]键，确认数据正确。"};
    public static String[] jTextTitle = {"进站接车","检查交接","参数设定","试风实验",
            "连接检查","查验证件", "发车准备","开车确认"};
    public static String[] jTextContent = {"按照规定走形线路行走，进出车站主动出示证件，接受安全检查。指定地点待乘，列车到达前10min在交接地点立岗接车。",
            "按规定检查机车；对口交接相关资料，事项并记录，相互签认。",
            "核对版本标签，LKJ数据版本号并记录。导入LKJ临时数据文件，拔卡查询。逐项输入数据参数。",
            "单阀全制，自阀减压100kPa并保持1min，漏泄量不超20kPa。",
            "检查确认机车与第一位车辆的车钩，车钩防跳装置，软管连接(制动主管，总风管)，折角塞门和机车走行部状态。",
            "检验添乘(等乘)机车人员证件或调度命令并做好记录。",
            "车机联控，全员确认行车凭证，机车信号，发车信号，厉行呼唤(应答)，查询列尾风压，确认制动机手柄和各开关位置，各仪表，显示屏显示，鸣笛动车。",
            "起动报点，后部瞭望(单司机除外)，准确按压[开车]键，确认数据正确"};
}
